Revit 2017 API
Asset.AssetType Property
Type of the item the asset represents.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public AssetType AssetType { get; }
Visual Basic
Public ReadOnly Property AssetType As AssetType
	Get
Visual C++
public:
property AssetType AssetType {
	AssetType get ();
}
Remarks
See AssetPropertyType for all available asset types.
See Also
Asset Class
Autodesk.Revit.Utility Namespace